###############################################################################
# Created by write_sdc
###############################################################################
current_design des_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[32]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[33]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[34]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[35]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[36]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[37]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[38]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[39]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[40]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[41]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[42]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[43]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[44]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[45]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[46]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[47]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[48]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[49]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[50]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[51]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[52]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[53]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[54]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[55]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[56]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[57]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[58]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[59]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[60]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[61]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[62]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[63]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_data[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_decipher_en}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_encipher_en}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[32]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[33]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[34]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[35]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[36]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[37]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[38]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[39]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[40]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[41]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[42]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[43]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[44]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[45]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[46]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[47]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[48]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[49]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[50]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[51]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[52]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[53]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[54]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[55]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[56]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[57]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[58]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[59]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[60]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[61]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[62]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[63]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {des_key_in[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_ready}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[32]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[33]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[34]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[35]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[36]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[37]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[38]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[39]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[40]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[41]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[42]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[43]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[44]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[45]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[46]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[47]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[48]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[49]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[50]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[51]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[52]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[53]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[54]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[55]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[56]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[57]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[58]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[59]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[60]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[61]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[62]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[63]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {desc_result[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {desc_ready}]
set_load -pin_load 0.0334 [get_ports {desc_result[63]}]
set_load -pin_load 0.0334 [get_ports {desc_result[62]}]
set_load -pin_load 0.0334 [get_ports {desc_result[61]}]
set_load -pin_load 0.0334 [get_ports {desc_result[60]}]
set_load -pin_load 0.0334 [get_ports {desc_result[59]}]
set_load -pin_load 0.0334 [get_ports {desc_result[58]}]
set_load -pin_load 0.0334 [get_ports {desc_result[57]}]
set_load -pin_load 0.0334 [get_ports {desc_result[56]}]
set_load -pin_load 0.0334 [get_ports {desc_result[55]}]
set_load -pin_load 0.0334 [get_ports {desc_result[54]}]
set_load -pin_load 0.0334 [get_ports {desc_result[53]}]
set_load -pin_load 0.0334 [get_ports {desc_result[52]}]
set_load -pin_load 0.0334 [get_ports {desc_result[51]}]
set_load -pin_load 0.0334 [get_ports {desc_result[50]}]
set_load -pin_load 0.0334 [get_ports {desc_result[49]}]
set_load -pin_load 0.0334 [get_ports {desc_result[48]}]
set_load -pin_load 0.0334 [get_ports {desc_result[47]}]
set_load -pin_load 0.0334 [get_ports {desc_result[46]}]
set_load -pin_load 0.0334 [get_ports {desc_result[45]}]
set_load -pin_load 0.0334 [get_ports {desc_result[44]}]
set_load -pin_load 0.0334 [get_ports {desc_result[43]}]
set_load -pin_load 0.0334 [get_ports {desc_result[42]}]
set_load -pin_load 0.0334 [get_ports {desc_result[41]}]
set_load -pin_load 0.0334 [get_ports {desc_result[40]}]
set_load -pin_load 0.0334 [get_ports {desc_result[39]}]
set_load -pin_load 0.0334 [get_ports {desc_result[38]}]
set_load -pin_load 0.0334 [get_ports {desc_result[37]}]
set_load -pin_load 0.0334 [get_ports {desc_result[36]}]
set_load -pin_load 0.0334 [get_ports {desc_result[35]}]
set_load -pin_load 0.0334 [get_ports {desc_result[34]}]
set_load -pin_load 0.0334 [get_ports {desc_result[33]}]
set_load -pin_load 0.0334 [get_ports {desc_result[32]}]
set_load -pin_load 0.0334 [get_ports {desc_result[31]}]
set_load -pin_load 0.0334 [get_ports {desc_result[30]}]
set_load -pin_load 0.0334 [get_ports {desc_result[29]}]
set_load -pin_load 0.0334 [get_ports {desc_result[28]}]
set_load -pin_load 0.0334 [get_ports {desc_result[27]}]
set_load -pin_load 0.0334 [get_ports {desc_result[26]}]
set_load -pin_load 0.0334 [get_ports {desc_result[25]}]
set_load -pin_load 0.0334 [get_ports {desc_result[24]}]
set_load -pin_load 0.0334 [get_ports {desc_result[23]}]
set_load -pin_load 0.0334 [get_ports {desc_result[22]}]
set_load -pin_load 0.0334 [get_ports {desc_result[21]}]
set_load -pin_load 0.0334 [get_ports {desc_result[20]}]
set_load -pin_load 0.0334 [get_ports {desc_result[19]}]
set_load -pin_load 0.0334 [get_ports {desc_result[18]}]
set_load -pin_load 0.0334 [get_ports {desc_result[17]}]
set_load -pin_load 0.0334 [get_ports {desc_result[16]}]
set_load -pin_load 0.0334 [get_ports {desc_result[15]}]
set_load -pin_load 0.0334 [get_ports {desc_result[14]}]
set_load -pin_load 0.0334 [get_ports {desc_result[13]}]
set_load -pin_load 0.0334 [get_ports {desc_result[12]}]
set_load -pin_load 0.0334 [get_ports {desc_result[11]}]
set_load -pin_load 0.0334 [get_ports {desc_result[10]}]
set_load -pin_load 0.0334 [get_ports {desc_result[9]}]
set_load -pin_load 0.0334 [get_ports {desc_result[8]}]
set_load -pin_load 0.0334 [get_ports {desc_result[7]}]
set_load -pin_load 0.0334 [get_ports {desc_result[6]}]
set_load -pin_load 0.0334 [get_ports {desc_result[5]}]
set_load -pin_load 0.0334 [get_ports {desc_result[4]}]
set_load -pin_load 0.0334 [get_ports {desc_result[3]}]
set_load -pin_load 0.0334 [get_ports {desc_result[2]}]
set_load -pin_load 0.0334 [get_ports {desc_result[1]}]
set_load -pin_load 0.0334 [get_ports {desc_result[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_decipher_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_encipher_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {des_key_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 2.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
